Revit 2027 API
BuiltInFailures.OverlapFailures.WallAreaBoundaryOverlap Property
 Wall and area boundary line overlap. Color fills, area tags and areas may not behave correctly.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WallAreaBoundaryOverlap { get; }
Public Shared ReadOnly Property WallAreaBoundaryOverlap As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WallAreaBoundaryOverlap {
	FailureDefinitionId^ get ();
}
static member WallAreaBoundaryOverlap : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace